---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.ForwardIterator
source: html/adc2f105-f4b0-e4e6-9c50-c03ff4f42fb7.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.